In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from IPython.display import display

In [5]:
# panda series

pd_series = pd.Series([10, 100, 15, 35, 35])
display(pd_series)

pd_series = pd.Series([1776, 1867, 1821], index=["USA", "CANADA", "MEXICO"])
pd_series

{
    "Apple": 1.2,
    "Banana": 0.8,
    "Orange": 1.5,
    "Mango": 2.5,
    "Grapes": 3.0,
    "Watermelon": 4.5,
    "Pineapple": 3.8
}
'''
create pd.Series
find the cost of Grapes using loc
print all indexes
print all values
print first 3 rows (using iloc)
'''

0     10
1    100
2     15
3     35
4     35
dtype: int64

USA       1776
CANADA    1867
MEXICO    1821
dtype: int64

In [11]:

# create the Series
prices = pd.Series({
    "Apple": 1.2,
    "Banana": 0.8,
    "Orange": 1.5,
    "Mango": 2.5,
    "Grapes": 3.0,
    "Watermelon": 4.5,
    "Pineapple": 3.8
})

display(prices)
print()

# find the cost of Grapes using loc
print("Cost of Grapes:", prices["Grapes"])  # does not work with df
print("Cost of Grapes:", prices.loc["Grapes"])
print()

# print all indexes
print("Indexes:", prices.index)
print()

# print all values
print("Values:", prices.values)
print()

# print first 3 rows (using iloc)
print("First 3 rows:\n", prices.iloc[:3])

Apple         1.2
Banana        0.8
Orange        1.5
Mango         2.5
Grapes        3.0
Watermelon    4.5
Pineapple     3.8
dtype: float64

Cost of Grapes: 3.0
Cost of Grapes: 3.0

Indexes: Index(['Apple', 'Banana', 'Orange', 'Mango', 'Grapes', 'Watermelon',
       'Pineapple'],
      dtype='object')

Values: [1.2 0.8 1.5 2.5 3.  4.5 3.8]

First 3 rows:
 Apple     1.2
Banana    0.8
Orange    1.5
dtype: float64

In [19]:
import numpy as np

np.random.seed(100)
my_data = np.random.randint(0, 101, (4, 3))
row_index = ['CA', 'NY', 'AZ', 'TX']
col_names = ['Jan', 'Feb', 'Mar']

# Create DataFrame
df = pd.DataFrame(my_data, index=row_index, columns=col_names)
df

# create grades df
# 1
# index = Alice, Bob, Martin, Shi, Dvir, Shlomo
# columns = 'Math', 'Physics', 'Chemistry', 'Biology'
# grades: seed(42)
# grades values in between 10-100
# 2 change Shi grade in Physics to 100. using at
# 3 print all Math column
# 4 print max grade of Chemistry
# 5 print min grade of Bioligy
# 6 print the avg of Physics
# 7 print all grades of Bob
# 8 print the avg grades of Bob using loc
# 9 print the entire avg of all of the df
# A print the df with only grades of Math Bioligy
# B print the last student using iloc


# 1) create grades df
np.random.seed(42)
students = ["Alice", "Bob", "Martin", "Shi", "Dvir", "Shlomo"]
cols = ["Physics", "Math", "Chemistry", "Biology"]
data = np.random.randint(10, 101, size=(len(students), len(cols)))
df = pd.DataFrame(data, index=students, columns=cols)


display(df)

# 2) change Shi grade in Physics to 100 using .at
df.at["Shi", "Physics"] = 100

# 3) print all Math column
print("Math column:\n", df["Math"])

# 4) print max grade of Chemistry
print("Max Chemistry grade:", df["Chemistry"].max())

# 5) print min grade of Biology
print("Min Biology grade:", df["Biology"].min())

# 6) print the avg of Physics
print("Average Physics grade:", df["Physics"].mean())

# 7) print all grades of Bob
print("Bob's grades:\n", df.loc["Bob"])

# 8) print the avg grades of Bob using loc
print("Bob's average grade:", df.loc["Bob"].mean())

# 9) print the entire avg of all of the df
print("Overall average grade:", df.values.mean())

# A) print the df with only grades of Math & Biology
print("Math & Biology only:\n", df[["Math", "Biology"]])

# B) print the last student using iloc
print("Last student (row):\n", df.iloc[-1])

type(df.values)

        Physics  Math  Chemistry  Biology
Alice        61    24         81       70
Bob          30    92         96       84
Martin       84    97         33       12
Shi          31    62         11       97
Dvir         39    47         11       73
Shlomo       69    30         42       85

Math column:
 Alice     24
Bob       92
Martin    97
Shi       62
Dvir      47
Shlomo    30
Name: Math, dtype: int32
Max Chemistry grade: 96
Min Biology grade: 12
Average Physics grade: 63.833333333333336
Bob's grades:
 Physics      30
Math         92
Chemistry    96
Biology      84
Name: Bob, dtype: int32
Bob's average grade: 75.5
Overall average grade: 59.583333333333336
Math & Biology only:
         Math  Biology
Alice     24       70
Bob       92       84
Martin    97       12
Shi       62       97
Dvir      47       73
Shlomo    30       85
Last student (row):
 Physics      69
Math         30
Chemistry    42
Biology      85
Name: Shlomo, dtype: int32

numpy.ndarray

In [58]:

'''
df[ df['age'] > 30 ]

df[ (df['age'] > 25) & (df['age'] < 35) ]

df[ (df['age'] < 28) | (df['name'] == 'Diana') ]

df[ ~(df['age'] == 33)]

df[ df['age'].between(28, 35) ]

df[ df['name'].isin(['Alice', 'Diana']) ]

df['ip_perc'] = 100 * df['tip'] / df['total_bill']  # the operation is 1 liner

--- apply column
def last4(cc):
    return cc[-4:]

df['CC-last4'] = df['CC Number'].apply(last4)  # the operation is more than 1 line ...

# lambda shortcut
df['CC-last4'] = df['CC Number'].apply(lambda cc: cc[-4:])

--- apply row
def get_generous(row):
    tip_perc = 100 * row['tip'] / row['total_bill']
    if tip_perc >= 25:
        return 'Generous'
    else:
        return 'Not-Generous'

df['Description'] = df.apply(get_generous, axis=1)  # axis=1 so the row will be sent 

'''

# C print all students and their grades for students that got Math > 80
# D update the math score to be 10% more 
# E add column 'math-genie' if the student math grade is bigger than 90 write 'genie' otherwise write 'human', using apply (column)
# F create column 'min-grade' and populate the min grade of each student, using apply (row)
# G create column 'avg-grade' and populate the avg grade of each student, using apply (row)
# H add column 'Excellent' , put V in this column for students with avg > 80 and X for others, using apply (row)

np.random.seed(42)
students = ["Alice", "Bob", "Martin", "Shi", "Dvir", "Shlomo"]
cols = ["Physics", "Math", "Chemistry", "Biology"]
data = np.random.randint(60, 101, size=(len(students), len(cols)))
df = pd.DataFrame(data, index=students, columns=cols)

display(df)

# C print all students and their grades for students that got Math > 80
print('math > 80:')
display(df[ df['Math'] > 80 ])

# D update the math score to be 10% more 
print('D update the math score to be 10% more ')
df['Math'] = df['Math'] * 1.1

# E add column 'math-genie' if the student math grade is bigger than 90 write 'genie' otherwise write 'human', using apply (column)
print('# E add column "math-genie" if the student')
def get_status(grade):
    return "math-genie" if grade > 80 else "human"

df['Math-Genie'] = df['Math'].apply(get_status)
df['Math-Genie'] = df['Math'].apply(lambda grade: "math-genie" if grade > 80 else "human")

# F create column 'min-grade' and populate the min grade of each student, using apply (row)
def get_min(row):
    return row.min()

df['Min-Grade'] = df.select_dtypes(include="number").apply(get_min, axis=1)
df['Min-Grade'] = df.select_dtypes(include="number").min(axis=1)

# G create column 'avg-grade' and populate the avg grade of each student, using apply (row)
def get_avg(row):
    return row.mean()

df['Avg-Grade'] = df.select_dtypes(include="number").drop(columns='Min-Grade').apply(get_avg, axis=1)
df['Avg-Grade'] = df.select_dtypes(include="number").drop(columns='Min-Grade').select_dtypes(include="number").mean(axis=1)

# H add column 'Excellent' , put V in this column for students with avg > 80 and X for others, using apply (row)
def get_desc(row):
    if row.mean() > 80:
        return 'V'
    else:
        return 'X'


df['Excellent'] = df.select_dtypes(include="number").drop(columns='Min-Grade').apply(get_desc, axis=1)

df

        Physics  Math  Chemistry  Biology
Alice        98    88         74       67
Bob          80    98         78       82
Martin       70    70         83       95
Shi          99    83         62       81
Dvir         61    83         89       97
Shlomo       61    80         92       71

math > 80:

       Physics  Math  Chemistry  Biology
Alice       98    88         74       67
Bob         80    98         78       82
Shi         99    83         62       81
Dvir        61    83         89       97

D update the math score to be 10% more
# E add column "math-genie" if the student

,Physics,Math,Chemistry,Biology,Math-Genie,Min-Grade,Avg-Grade,Excellent
Alice,98,96.8,74,67,math-genie,67.0,83.950,V
Bob,80,107.8,78,82,math-genie,78.0,86.950,V
Martin,70,77.0,83,95,human,70.0,81.250,V
Shi,99,91.3,62,81,math-genie,62.0,83.325,V
Dvir,61,91.3,89,97,math-genie,61.0,84.575,V
Shlomo,61,88.0,92,71,math-genie,61.0,78.000,X

In [59]:
np.random.seed(42)
students = ["Alice", "Bob", "Martin", "Shi", "Dvir", "Shlomo"]
cols = ["Physics", "Math", "Chemistry", "Biology"]
data = np.random.randint(60, 101, size=(len(students), len(cols)))
df = pd.DataFrame(data, index=students, columns=cols)

df

'''

df = df.drop(0, axis=0)  # row by index
df = df.drop('age_squared', axis=1)  # column

######################## concat row
# First DataFrame
df1 = pd.DataFrame({
    "A": [1, 2, 3],
    "B": [4, 5, 6]
})

# Second DataFrame
df2 = pd.DataFrame({
    "A": [7, 8, 9],
    "B": [10, 11, 12]
})

# Concatenate by rows (axis=0)
result = pd.concat([df1, df2], axis=0, ignore_index=False)

######################## concat column

# First DataFrame
df1 = pd.DataFrame({
    "A": [1, 2, 3],
    "B": [4, 5, 6]
})

# Second DataFrame
df2 = pd.DataFrame({
    "C": ["x", "y", "z"],
    "D": ["p", "q", "r"]
})

# Concatenate by column (axis=1)
result = pd.concat([df1, df2], axis=1)

### Replace row with .loc
df.loc['danny'] = ['Bobby', 32]  

1 drop column Math (just print, dont actually remove)
2 drop row 'Bob'
3 add new row : Motti  Physics[91]	Math[88]	Chemistry[70]	Biology[98] -- using concat
4 add new column city: Tel-aviv, Rishon, Nes-zyiona, Kfar-tavot, Tel-aviv, Herzelliya, Beer-sheva
5 replace grades for Martin to: 80, 56, 99, 100, 'Dimona'

'''

        Physics  Math  Chemistry  Biology
Alice        98    88         74       67
Bob          80    98         78       82
Martin       70    70         83       95
Shi          99    83         62       81
Dvir         61    83         89       97
Shlomo       61    80         92       71